In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] =(20,10)

In [5]:
df1 = pd.read_csv("../data/raw/Bengaluru_House_Data.csv")

df1.head()

#Checking the  attributes of teh dataset

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [1]:
# # print(df1.size)

# print(df1.groupby('area_type')['area_type'].agg('count'))
# # print(df1.groupby('area_type').value_counts())
# checking_groupby = df1.groupby('area_type')
# print(checking_groupby.first())
# # print(checking_groupby.first())
# # checking_groupby.get_group('Built-up  Area')['area_type'].agg('count')

# # Checking the size of the dataset

In [7]:
df1.shape

(13320, 9)

In [12]:
df1.groupby("area_type")["area_type"].count()

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [13]:
df2= df1.drop(['area_type','society','balcony','availability'], axis=1)
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [14]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [15]:
df3 = df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [16]:
print(df3.shape[0] * df3.shape[1])
print(df3.shape)

66230
(13246, 5)

In [21]:
df3.columns

Index(['location', 'size', 'total_sqft', 'bath', 'price'], dtype='object')

In [20]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [28]:
##inconsistencies in the size column

df3["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [38]:
# will convert columns to only numbers

df3["bhk"]=  df3["size"].apply(lambda x: x.split(" ")[0])
df3["bhk"].head()

C:\Users\hp\AppData\Local\Temp\ipykernel_19328\3278336888.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["bhk"]=  df3["size"].apply(lambda x: x.split(" ")[0])

0    2
1    4
2    3
3    3
4    2
Name: bhk, dtype: object

In [41]:
df3.bhk.unique()

['1',
 '10',
 '11',
 '12',
 '13',
 '14',
 '16',
 '18',
 '19',
 '2',
 '27',
 '3',
 '4',
 '43',
 '5',
 '6',
 '7',
 '8',
 '9']

# Exploring the bedroom column for unique values and to clean it up,created new column for bedroom named "bhk" of type : int
#

In [50]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [53]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split(" ")[0]))

C:\Users\hp\AppData\Local\Temp\ipykernel_880604\2773794992.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split(" ")[0]))

In [43]:
df3["bhk"] = pd.to_numeric(df3.bhk)

C:\Users\hp\AppData\Local\Temp\ipykernel_19328\1352391442.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["bhk"] = pd.to_numeric(df3.bhk)

In [44]:
df3[df3.bhk> 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

### Inconsistencies between the number of bedrooms and the  total_sqft( total squarefeet)
#### exploring the total_sqft column

In [57]:
df3.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [45]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [50]:
df3["total_sqft"].apply(is_float)

13246

In [61]:
df3[~df3["total_sqft"].apply(is_float)]["total_sqft"].unique

<bound method Series.unique of 30       2100 - 2850
122      3067 - 8156
137      1042 - 1105
165      1145 - 1340
188      1015 - 1540
            ...
12975     850 - 1060
12990    1804 - 2273
13059    1200 - 1470
13265    1133 - 1384
13299    2830 - 2882
Name: total_sqft, Length: 190, dtype: object>

In [76]:
df3[~df3["total_sqft"].apply(is_float)]["total_sqft"].head(10)

30        2100 - 2850
122       3067 - 8156
137       1042 - 1105
165       1145 - 1340
188       1015 - 1540
410    34.46Sq. Meter
549       1195 - 1440
648         4125Perch
661       1120 - 1145
672       3090 - 5002
Name: total_sqft, dtype: object

In [68]:
name = "4 - 6"
water = name.split("-")
water

['4 ', ' 6']

In [84]:
def convert_sqft_to_num (x):
    tokens = x.split("-")
    if len(tokens) == 2:
        return (float(float(tokens[0])+float(tokens[1]))/2)
    try:
        return float(x)
    except:
        return None

In [75]:
# testing convertsqfttonumm function

print(convert_sqft_to_num("20021"))
convert_sqft_to_num("3000 - 4000")

20021.0

7000.0

In [85]:
df4 = df3.copy()
df4["total_sqft"] =df4["total_sqft"].apply(convert_sqft_to_num)

In [86]:
df4["total_sqft"]

0        1056.0
1        2600.0
2        1440.0
3        1521.0
4        1200.0
          ...
13315    3453.0
13316    3600.0
13317    1141.0
13318    4689.0
13319     550.0
Name: total_sqft, Length: 13246, dtype: float64

In [87]:
df3.loc[30]

location        Yelahanka
size                4 BHK
total_sqft    2100 - 2850
bath                  4.0
price               186.0
bhk                     4
Name: 30, dtype: object

In [81]:
(2100+2850)/2

2475.0

In [88]:
df4.loc[30,"total_sqft"]  ==2475

True

Feature Engineering
- outlier detection and removal
- price per sqft si important in real estate as this can vary from location to location

In [90]:
df5 = df4.copy()
df5["price_per_sqft"] = df5["price"]* 100000/ df5["total_sqft"]

In [91]:
df5["location"].nunique()

1304

In [92]:
df5.location = df5.location.apply(lambda x : x.strip())